{
  "headline": "CORN SLIPS, WHEAT RALLIES AT COMMODITY CLASSIC",
  "subheadline": "Front-month corn drops over 1% while Chicago wheat posts a 2.5% gain heading into the weekend.",
  "lead": "Corn futures gave back ground Friday, with the front month settling at 438.75, down 1.13%. Chicago wheat stole the show, jumping 2.51% to 591.25. Soybeans slid 0.71% to 1157.25 as soybean meal took a 2% hit. The trade heads into the weekend digesting news from Commodity Classic 2026 in the heart of corn country.",
  "date": "Saturday, February 28, 2026",
  "teaser": "Wheat rallies, corn stumbles, and Commodity Classic buzzes—here's what farmers need to know.",
  "one_number": {
    "value": "+2.51%",
    "unit": "Chicago Wheat",
    "context": "Wheat's Friday rally stands out in a session where corn and beans both finished red."
  },
  "sections": [
    {
      "title": "GRAINS & OILSEEDS",
      "body": "Front-month corn settled at 438.75, off 1.13%, while December 2026 corn held firmer at 469.5, up 0.43%. Chicago wheat surged 2.51% to 591.25—the standout gainer in the grains complex. Soybeans slipped to 1157.25, weighed down by a 2.05% drop in soybean meal to 315.5."
    },
    {
      "title": "WEATHER & FIELD CONDITIONS",
      "body": "Central Illinois is dry and cool—42°F under overcast skies with only a 2% chance of precipitation. The 3-day precip total sits at zero, meaning soils remain firm. Highs near 50°F and lows in the mid-20s mean no field work yet, but conditions are stable heading into March."
    },
    {
      "title": "MARKETS & MACRO",
      "body": "Live cattle jumped nearly 3% to 244.0, a strong close for the beef complex. Crude oil rallied 2.62% to 67.02, which could lift input costs if sustained. The dollar index was flat at 97.565, offering no major headwind or tailwind for exports. Treasury yields eased slightly."
    }
  ],
  "watch_list": [
    {
      "time": "Today",
      "desc": "Weekend position squaring—watch for Monday open tone after Commodity Classic headlines digest."
    },
    {
      "time": "This Week",
      "desc": "USDA weekly export inspections and any weather shifts as March begins."
    },
    {
      "time": "Key Risk",
      "desc": "Soybean meal weakness dragging the crush complex lower and pressuring bean prices."
    },
    {
      "time": "Key Opportunity",
      "desc": "Wheat momentum—if Chicago wheat holds above 590, bulls may push for a test of 600."
    }
  ],
  "source": "Yahoo Finance · USDA · Open-Meteo",
  "generated_utc": "2026-02-28T23:55:40Z",
  "prices_fetched": "2026-02-28T19:01:23Z",
  "news_sources": [
    "USDA News",
    "AgWeb",
    "Farm Progress",
    "DTN Progressive Farmer",
    "Reuters Commodities"
  ]
}