{
  "headline": "CORN SLIDES, WHEAT RALLIES AS CLASSIC WRAPS",
  "subheadline": "Front-month corn drops over 1% while Chicago wheat surges on renewed export interest.",
  "lead": "Corn took it on the chin Friday, with the front month settling at 438.75 — down 1.13% — while new-crop December held up better at 469.50. Chicago wheat was the standout, rallying 2.51% to 591.25. Soybeans softened modestly, but the real pressure hit soybean meal, down over 2%.",
  "date": "Saturday, February 28, 2026",
  "teaser": "Wheat surges, corn slides, and Commodity Classic delivers tech buzz — here's your Saturday snapshot.",
  "one_number": {
    "value": "+2.51%",
    "unit": "Chicago Wheat",
    "context": "Wheat's sharp rally signals potential export demand revival and could pull row crop acres into the conversation."
  },
  "sections": [
    {
      "title": "GRAINS & OILSEEDS",
      "body": "Front-month corn at 438.75 lost over five cents on the session, but the December 2026 contract edged up to 469.50 — watch that carry for storage signals. Soybeans at 1157.25 slipped 0.71%, with meal taking the harder hit at 315.50. Wheat's 2.51% pop to 591.25 is the number that matters — if it holds Monday, expect spillover chatter on spring planting intentions."
    },
    {
      "title": "WEATHER & FIELD CONDITIONS",
      "body": "Central Illinois sits at 48°F under overcast skies with almost no moisture in the forecast — just 2% precip chance and zero inches over the last three days. That's decent for any fieldwork that needs doing, but soil temps remain a non-factor until mid-March. No spray windows to worry about today; enjoy the dry weekend."
    },
    {
      "title": "MARKETS & MACRO",
      "body": "Live cattle ripped 2.96% to 244.00 — feedlot margins are getting interesting. Crude oil jumped 2.62% to 67.02, which puts a floor under input costs. The dollar index slipped to 97.565, mildly supportive for exports. Ten-year yields dropped to 3.96%, signaling markets still betting on a soft landing."
    }
  ],
  "watch_list": [
    {
      "time": "Today",
      "desc": "Commodity Classic 2026 final sessions — announcements on tech and input pricing."
    },
    {
      "time": "This Week",
      "desc": "USDA weekly export sales Thursday — wheat demand confirmation is key."
    },
    {
      "time": "Key Risk",
      "desc": "South American harvest pressure continues; Brazil's second-crop corn on pace."
    },
    {
      "time": "Key Opportunity",
      "desc": "Wheat rally could extend if Black Sea logistics tighten; new-crop beans look undervalued."
    }
  ],
  "source": "Yahoo Finance · USDA · Open-Meteo",
  "generated_utc": "2026-02-28T19:13:27Z",
  "prices_fetched": "2026-02-28T19:01:23Z",
  "news_sources": [
    "USDA News",
    "AgWeb",
    "Farm Progress",
    "DTN Progressive Farmer",
    "Reuters Commodities"
  ]
}