{
  "headline": "Wheat Rallies Hard, Corn Stumbles Into March",
  "subheadline": "Chicago wheat jumped over 2.5% while corn slipped — and cattle hit prices we haven't seen in a while.",
  "lead": "If you're sitting on old-crop wheat, this was a good week to be watching the board. Chicago wheat jumped 2.51% to $5.91¼, its strongest move in weeks, while front-month corn slipped about a penny to $4.38¾. The story that matters most: live cattle surged nearly 3% to $244 — that's real money for anyone selling calves this spring. Meanwhile, soybean meal took a 2% hit, which pinches crush margins (that's the profit elevators make turning beans into meal and oil) and could drag bean prices if it keeps up.",
  "date": "Monday, March 2, 2026",
  "teaser": "Wheat surges, cattle hit big numbers, and a cold week ahead could slow early fieldwork across the belt.",
  "one_number": {
    "value": "$244.00",
    "unit": "Live Cattle Futures",
    "context": "Cattle jumped nearly 3% on Friday's settle. If you're a cow-calf producer planning spring sales, this is the kind of number that makes your banker smile. It's also pushing feeder cattle around, so keep an eye on the basis at your local sale barn."
  },
  "sections": [
    {
      "title": "Grains & Oilseeds",
      "body": "Corn front-month settled at $4.38¾, down about a penny, but here's the thing — Dec '26 corn (your new-crop contract) actually ticked up to $4.69½. That tells you the market sees some optimism ahead for the crop that's not planted yet. Beans slid to $11.57¼ with the November new-crop contract flat at $11.28¼. Soybean meal got hit hardest, down over 2% to $315.50 — if you're a livestock producer buying feed, that's welcome relief, but for bean farmers it means less demand pull from the crush plants. Wheat was the star, rallying to $5.91¼. The corn-bean ratio (price of beans divided by corn) is sitting right around 2.64, which historically still favors planting beans over corn, though it's tightened a bit."
    },
    {
      "title": "Livestock, Dairy & Feed",
      "body": "Live cattle surged to $244.00 — up nearly 3% — and that's the number that's going to get talked about at every sale barn this week. Packers are paying up because retail beef demand is holding strong heading into grilling season. Feeder cattle dipped slightly to $355.42, but with feed costs (corn + meal) softening, the feeding margins are looking better than they have in months. Lean hogs were fairly quiet. Class III milk (the benchmark for dairy farmers) held steady, which is fine news if you're milking — no drama is good drama right now."
    },
    {
      "title": "Weather & Field Conditions",
      "body": "It's still winter across most of the belt — Central Illinois woke up to 27°F this morning with highs only reaching the low 40s. Central Iowa and Wisconsin are in a similar pattern, and South Dakota is colder yet. The 5-day outlook shows a mostly dry week with daytime highs gradually climbing toward the mid-40s in the southern belt. That means frost is still coming out of the ground slowly — don't get in a hurry on any early fieldwork. Wind was stiff on Friday at 16 mph in central IL, which will help dry out some topsoil where the frost heave has been working. No meaningful precipitation in the 5-day forecast for any of the five locations we track. If you were hoping to do any early burndown spraying, the temps need to come up another 10-15 degrees before most herbicides will be effective."
    },
    {
      "title": "Energy, Dollar & Outside Markets",
      "body": "Crude oil rallied 2.6% to $67.02 — that matters for two reasons. First, higher crude means your diesel and anhydrous ammonia (nitrogen fertilizer, which is made from natural gas) get more expensive. Second, it supports ethanol margins, which is actually good news for corn demand. Natural gas was fairly flat. The dollar index slipped to 97.57, and a weaker dollar is generally good for grain farmers because it makes US crops cheaper for foreign buyers — that can boost export demand. The S&P 500 drifted lower, which isn't an ag story directly, but it tells you there's some caution in the broader market."
    },
    {
      "title": "Policy, Trade & Big Picture",
      "body": "Monday morning, keep an eye out for USDA's weekly export inspections — last week's numbers for corn and beans were decent but not blow-the-doors-off good. Crop Progress reports should resume soon as we get into March, and those early planting intention signals will start driving new-crop price action. On the trade front, there's been chatter about Chinese soybean buying slowing down, which would be bearish for beans if it holds. Commodity Classic wrapped up over the weekend — if you missed it, watch for tech and seed announcements that could affect your input plans for '26."
    }
  ],
  "the_more_you_know": {
    "title": "Why Corn Rows Face East-West",
    "body": "Most corn in the Midwest is planted in rows running north-south, but did you know that University of Illinois research found that east-west rows can yield 2-4% less because of how sunlight hits the canopy? North-south rows let both sides of the plant catch morning and afternoon sun more evenly. It's one of those small details that adds up to real bushels across a whole section."
  },
  "daily_quote": {
    "text": "The farmer has to be an optimist or he wouldn't still be a farmer.",
    "attribution": "Will Rogers"
  },
  "watch_list": [
    {
      "time": "Today",
      "desc": "Markets closed Sunday — use the downtime to review your marketing plan and forward-contract targets for the week ahead."
    },
    {
      "time": "This Week",
      "desc": "USDA weekly export inspections drop Monday morning. Look for corn shipment pace — we need about 48M bushels/week to hit USDA's full-year target."
    },
    {
      "time": "On the Horizon",
      "desc": "USDA Prospective Plantings report comes at the end of March — the acreage numbers in that report will set the tone for new-crop prices through spring."
    },
    {
      "time": "Risk to Watch",
      "desc": "Soybean meal weakness could keep dragging bean prices lower if crush margins stay thin. If you have unpriced old-crop beans, that's a headwind to be aware of."
    },
    {
      "time": "Opportunity",
      "desc": "New-crop corn (Dec '26) showing resilience at $4.69½ — if you haven't started pricing your 2026 corn crop, consider scaling in some sales on any push toward $4.75-4.80."
    }
  ],
  "source_summary": "USDA, AgWeb, DTN, Reuters, Brownfield Ag, Farm Progress, Open-Meteo, Yahoo Finance",
  "generated_utc": "2026-03-02T11:00:00Z",
  "prices_fetched": "2026-03-01T00:46:00Z",
  "news_sources": ["USDA News", "USDA ERS", "USDA FAS (Trade)", "AgWeb", "Farm Progress", "DTN Progressive", "Successful Farming", "Brownfield Ag", "Reuters Business", "World-Grain", "Beef Magazine", "Hoard's Dairyman", "Drovers (Cattle)", "NOAA Climate", "Farm Policy News", "RFD-TV Rural"],
  "weather_locations": ["Central Illinois", "Central Iowa", "Central Wisconsin", "Central South Dakota", "Southeast Nebraska"],
  "version": "2.0"
}
