{
  "headline": "Wheat Surges 2.6% as Cattle Slide Sharply",
  "subheadline": "Chicago wheat jumped nearly 15 cents while live cattle fell $4.75 amid broad livestock weakness and weekend weather uncertainty.",
  "lead": "Chicago wheat futures closed Friday up 14.75 cents to $5.91½, the strongest single-day gain in weeks, while live cattle dropped $4.75 to $232.23 as the livestock complex took a beating. Corn added 4.75 cents to $4.48½ on short covering, and soybeans tacked on 5.25 cents to $11.70¾. The moves set up an interesting week: grain producers face a split weather pattern with dry conditions across the western Corn Belt but 1-1.5 inches of rain coming to Illinois and parts of Indiana by midweek. For livestock producers, the sharp drop in cattle futures—down 2% in one session—reflects softer cash trade and profit-taking after a strong run, but margins remain historically solid for those with cattle on feed.",
  "date": "Sunday, March 1, 2026",
  "teaser": "Wheat rallies hard, cattle tumble, and a wet week looms for parts of the eastern Corn Belt.",
  "one_number": {
    "value": "14.75¢",
    "unit": "Friday's wheat futures gain—biggest pop in weeks",
    "context": "That 2.6% jump in Chicago wheat suggests short covering and weather concerns in global wheat areas. If you're sitting on old-crop wheat in the bin, this rally might be your best selling window before harvest pressure returns. Watch basis levels at your local elevator this week—if they're firm, don't wait."
  },
  "sections": [
    {
      "title": "Grains & Oilseeds",
      "body": "Corn closed Friday at $4.48½, up 4¾ cents, while December '26 sits at $4.69½—a 21-cent carry that favors storage if you have decent basis and low carrying costs. Soybeans gained 5¼ cents to $11.70¾, but November '26 was flat at $11.28¼, showing a 42-cent inverse that rewards forward selling new crop if you're confident in your yield. Wheat stole the show with a 14¾-cent jump to $5.91½ on technical buying and short covering. The corn-bean price ratio sits at 2.61 bushels of corn to buy one bushel of beans—near the five-year average, so no huge planting signal either way yet. Oats were quiet, down a quarter-cent."
    },
    {
      "title": "Livestock, Dairy & Feed",
      "body": "Live cattle futures got hammered Friday, down $4.75 to $232.23, and feeders dropped $7.60 to $351.20—both down roughly 2% in one session as cash trade softened and funds took profits. Lean hogs were steady at 95.6 cents. Class III milk took a brutal 6% hit, down $1.06 to $16.28, squeezing dairy margins. Soybean meal eased $1.60 to $320.50, but with corn and meal both relatively soft, feed costs remain manageable for cattle feeders—though that cattle price drop means the margin cushion just got thinner. If you're marketing fat cattle this week, don't panic-sell into the weekend weakness; cash trade could stabilize early in the week."
    },
    {
      "title": "Weather & Field Conditions",
      "body": "The Corn Belt is splitting this week. Central Illinois is tracking 1.49 inches of rain over the next five days, with the heaviest Wednesday-Thursday (1.37 inches combined), which will saturate soils and delay any early fieldwork. Iowa and Nebraska stay drier—just 0.10-0.22 inches—so northern and western areas could see some equipment moving if temps cooperate. South Dakota is warming nicely, hitting 70° by Friday with zero precip, which is good news for early spring prep. Wisconsin stays cold and quiet. If you're planning burndown applications or early nitrogen, the window in Iowa/Nebraska is Monday-Tuesday before moisture chances rise midweek. Illinois and Indiana producers should plan shop work and maintenance through Thursday; those fields will be too wet to roll."
    },
    {
      "title": "Energy, Dollar & Outside Markets",
      "body": "Crude oil jumped $1.71 to $67.02, and natural gas gained 4 cents to $2.86—both supportive for corn via ethanol and fertilizer demand, though higher energy costs add to input expenses for spring. The dollar index was flat at 97.62, which keeps US grain export-competitive. The S&P 500 dipped 0.4%, and the 10-year Treasury yield fell to 3.96%, signaling some investor caution but nothing alarming. Gold and silver rallied sharply (gold up $47, silver up $3.16), often a sign of safe-haven buying, but agricultural fundamentals remain more important than outside market jitters right now."
    },
    {
      "title": "Policy, Trade & Big Picture",
      "body": "USDA released several reports Friday: trout production down 6%, egg products up 8%, and the January Agricultural Prices index down 3.9% from last year—a reminder that farm-level price pressure continues. The Cold Storage Annual Summary hit the wire, though details weren't market-moving. More significant: Farm Bureau data shows Chapter 12 farm bankruptcies jumped 46% in 2025 to 315 filings, up from 216 in 2024, a stark reminder of margin stress across the sector. USDA Secretary Brooke Rollins announced plans to sell the department's flagship South Building in Washington as part of cost-cutting, though that's symbolic more than operational. Dicamba is back for 2026 with tighter compliance—if you plan to use over-the-top applications, get trained early and communicate with neighbors now to avoid drift issues."
    }
  ],
  "the_more_you_know": {
    "title": "Why Wheat Pops on Fridays",
    "body": "Wheat futures often see exaggerated moves on Friday afternoons due to 'weekend risk' and short covering. Speculators don't want to hold short positions over the weekend when global weather or geopolitical news could break, so they buy back contracts to flatten exposure. That's part of why Friday's 14¾-cent wheat rally was so sharp—funds were caught leaning short and scrambled to cover. It's a pattern worth watching if you're timing grain sales."
  },
  "daily_quote": {
    "text": "The farmer has to be an optimist or he wouldn't still be a farmer.",
    "attribution": "Will Rogers, humorist and ranch owner"
  },
  "watch_list": [
    {
      "time": "Today",
      "desc": "Weekend weather models for Argentina and Brazil—any shifts in South American moisture forecasts could move soybeans Monday morning."
    },
    {
      "time": "This Week",
      "desc": "Cash cattle trade Tuesday-Wednesday. After Friday's futures drop, watch whether packers press bids lower or if feedlots hold firm on prices."
    },
    {
      "time": "On the Horizon",
      "desc": "March 15 is the crop insurance sales closing deadline for spring crops. If you haven't updated your APH yields or coverage levels, you're out of time in two weeks."
    },
    {
      "time": "Risk to Watch",
      "desc": "A stronger-than-expected South American soybean harvest could pressure US bean prices through spring. Brazil's harvest is 40% complete and yields are solid—any upward USDA revisions to their crop would weigh on our export demand and prices."
    },
    {
      "time": "Opportunity",
      "desc": "December '26 corn at $4.69½ with 21 cents of carry rewards storage. If your on-farm bins are empty and basis is 20-under or better, consider holding old crop and pricing new crop instead to capture that carry—just make sure your storage cost is under 3 cents/month."
    },
    {
      "time": "This week",
      "desc": "Cold Storage Annual Summary"
    }
  ],
  "source_summary": "USDA NASS, Yahoo Finance, Open-Meteo weather data, Farm Journal, Farm Progress, Brownfield Ag News, AG Daily, Agweek",
  "generated_utc": "2026-03-01T17:30:26Z",
  "prices_fetched": "2026-03-01T14:53:27Z",
  "news_sources": [
    "Brownfield Ag",
    "Agweek",
    "Morning Ag Clips",
    "Beef Magazine",
    "All Ag News",
    "USDA NASS Reports",
    "CropLife",
    "Farm Journal",
    "AG Daily",
    "Farm Progress",
    "Farm Policy News",
    "NOAA Climate"
  ],
  "weather_locations": [
    "Central Illinois",
    "Central Iowa",
    "Central Wisconsin",
    "Central South Dakota",
    "Southeast Nebraska"
  ],
  "version": "2.0"
}